In [43]:
# Load yellow cab data
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
yellow = pd.read_csv("../input/yellow_tripdata_2016-01.csv", index_col=False)

In [44]:
yellow.head()
yellow.columns

Index([u'VendorID', u'tpep_pickup_datetime', u'tpep_dropoff_datetime',
       u'passenger_count', u'trip_distance', u'pickup_longitude',
       u'pickup_latitude', u'RatecodeID', u'store_and_fwd_flag',
       u'dropoff_longitude', u'dropoff_latitude', u'payment_type',
       u'fare_amount', u'extra', u'mta_tax', u'tip_amount', u'tolls_amount',
       u'improvement_surcharge', u'total_amount'],
      dtype='object')

In [45]:
yellow.columns = [c.replace(" ", "") for c in yellow.columns]
yellow.drop([col for col in ["VendorID","tpep_dropoff_datetime","passenger_count",\
                           "trip_distance","RatecodeID","store_and_fwd_flag",\
                           "dropoff_longitude","dropoff_latitude","payment_type",\
                           "fare_amount","extra","mta_tax","tip_amount","tolls_amount",\
                           "improvement_surcharge","total_amount"] \
                           if col in yellow], axis=1, inplace=True)

In [46]:
yellow.head()

,tpep_pickup_datetime,pickup_longitude,pickup_latitude
0,2016-01-01 00:00:00,-73.990372,40.734695
1,2016-01-01 00:00:00,-73.980782,40.729912
2,2016-01-01 00:00:00,-73.984550,40.679565
3,2016-01-01 00:00:00,-73.993469,40.718990
4,2016-01-01 00:00:00,-73.960625,40.781330

In [48]:
yellow.columns=['Date', 'Longitude', 'Latitude']
yellow["Type"] = "yellow"
yellow.head()

,Date,Longitude,Latitude,Type
0,2016-01-01 00:00:00,-73.990372,40.734695,yellow
1,2016-01-01 00:00:00,-73.980782,40.729912,yellow
2,2016-01-01 00:00:00,-73.984550,40.679565,yellow
3,2016-01-01 00:00:00,-73.993469,40.718990,yellow
4,2016-01-01 00:00:00,-73.960625,40.781330,yellow

In [49]:
# Transform the datetime into format "yyyy-mm-dd-hh"
yellow["Date"] = yellow["Date"].str[0:13].replace("\s+","-", regex=True)
yellow.head()

,Date,Longitude,Latitude,Type
0,2016-01-01-00,-73.990372,40.734695,yellow
1,2016-01-01-00,-73.980782,40.729912,yellow
2,2016-01-01-00,-73.984550,40.679565,yellow
3,2016-01-01-00,-73.993469,40.718990,yellow
4,2016-01-01-00,-73.960625,40.781330,yellow

In [50]:
# Load green cab data
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
green = pd.read_csv("../input/green_tripdata_2016-01.csv", index_col=False)
green.head()

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
0,2,2016-01-01 00:29:24,2016-01-01 00:39:36,N,1,-73.928642,40.680611,-73.924278,40.698044,1,...,8.0,0.5,0.5,1.86,0.0,NaN,0.3,11.16,1,1.0
1,2,2016-01-01 00:19:39,2016-01-01 00:39:18,N,1,-73.952675,40.723175,-73.923920,40.761379,1,...,15.5,0.5,0.5,0.00,0.0,NaN,0.3,16.80,2,1.0
2,2,2016-01-01 00:19:33,2016-01-01 00:39:48,N,1,-73.971611,40.676105,-74.013161,40.646072,1,...,16.5,0.5,0.5,4.45,0.0,NaN,0.3,22.25,1,1.0
3,2,2016-01-01 00:22:12,2016-01-01 00:38:32,N,1,-73.989502,40.669579,-74.000648,40.689034,1,...,13.5,0.5,0.5,0.00,0.0,NaN,0.3,14.80,2,1.0
4,2,2016-01-01 00:24:01,2016-01-01 00:39:22,N,1,-73.964729,40.682854,-73.940720,40.663013,1,...,12.0,0.5,0.5,0.00,0.0,NaN,0.3,13.30,2,1.0

In [51]:
green.head()

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
0,2,2016-01-01 00:29:24,2016-01-01 00:39:36,N,1,-73.928642,40.680611,-73.924278,40.698044,1,...,8.0,0.5,0.5,1.86,0.0,NaN,0.3,11.16,1,1.0
1,2,2016-01-01 00:19:39,2016-01-01 00:39:18,N,1,-73.952675,40.723175,-73.923920,40.761379,1,...,15.5,0.5,0.5,0.00,0.0,NaN,0.3,16.80,2,1.0
2,2,2016-01-01 00:19:33,2016-01-01 00:39:48,N,1,-73.971611,40.676105,-74.013161,40.646072,1,...,16.5,0.5,0.5,4.45,0.0,NaN,0.3,22.25,1,1.0
3,2,2016-01-01 00:22:12,2016-01-01 00:38:32,N,1,-73.989502,40.669579,-74.000648,40.689034,1,...,13.5,0.5,0.5,0.00,0.0,NaN,0.3,14.80,2,1.0
4,2,2016-01-01 00:24:01,2016-01-01 00:39:22,N,1,-73.964729,40.682854,-73.940720,40.663013,1,...,12.0,0.5,0.5,0.00,0.0,NaN,0.3,13.30,2,1.0

In [52]:
green.columns

Index([u'VendorID', u'lpep_pickup_datetime', u'Lpep_dropoff_datetime',
       u'Store_and_fwd_flag', u'RateCodeID', u'Pickup_longitude',
       u'Pickup_latitude', u'Dropoff_longitude', u'Dropoff_latitude',
       u'Passenger_count', u'Trip_distance', u'Fare_amount', u'Extra',
       u'MTA_tax', u'Tip_amount', u'Tolls_amount', u'Ehail_fee',
       u'improvement_surcharge', u'Total_amount', u'Payment_type',
       u'Trip_type '],
      dtype='object')

In [53]:
green.columns = [c.replace(" ", "") for c in green.columns]
green.drop([col for col in ["VendorID","Lpep_dropoff_datetime","Store_and_fwd_flag", "RateCodeID",\
                           "Dropoff_longitude","Dropoff_latitude","Passenger_count","Fare_amount",\
                           "Trip_distance","Tip_amount", "Total_amount","Payment_type",\
                           "Extra","MTA_tax","Tolls_amount","Ehail_fee","improvement_surcharge","Trip_type"] \
                           if col in green], axis=1, inplace=True)

In [54]:
green.head()

,lpep_pickup_datetime,Pickup_longitude,Pickup_latitude
0,2016-01-01 00:29:24,-73.928642,40.680611
1,2016-01-01 00:19:39,-73.952675,40.723175
2,2016-01-01 00:19:33,-73.971611,40.676105
3,2016-01-01 00:22:12,-73.989502,40.669579
4,2016-01-01 00:24:01,-73.964729,40.682854

In [55]:
green.columns=['Date', 'Longitude', 'Latitude']
green["Type"] = "green"
green.head()

,Date,Longitude,Latitude,Type
0,2016-01-01 00:29:24,-73.928642,40.680611,green
1,2016-01-01 00:19:39,-73.952675,40.723175,green
2,2016-01-01 00:19:33,-73.971611,40.676105,green
3,2016-01-01 00:22:12,-73.989502,40.669579,green
4,2016-01-01 00:24:01,-73.964729,40.682854,green

In [56]:
# Transform the datetime into format "yyyy-mm-dd-hh"
green["Date"] = green["Date"].str[0:13].replace("\s+","-", regex=True)
green.head()

,Date,Longitude,Latitude,Type
0,2016-01-01-00,-73.928642,40.680611,green
1,2016-01-01-00,-73.952675,40.723175,green
2,2016-01-01-00,-73.971611,40.676105,green
3,2016-01-01-00,-73.989502,40.669579,green
4,2016-01-01-00,-73.964729,40.682854,green

In [57]:
# Load weather data, ref: ftp://ftp.ncdc.noaa.gov/pub/data/noaa/
weather = pd.read_csv("../input/weather.csv")
weather = pd.DataFrame(weather)
weather.columns = [c.replace(" ", "") for c in weather.columns]
weather = weather.drop_duplicates(subset='IDX', keep='first')
weather.head()

,YR--MODAHRMN,SPD,TEMP,DEWP,PCP01,SD,IDX
0,201401010051,10.0,30.0,12.0,0.0,0,2014010100
1,201401010151,8.0,30.0,11.0,0.0,0,2014010101
2,201401010251,8.0,28.0,8.0,0.0,0,2014010102
3,201401010351,7.0,27.0,5.0,0.0,0,2014010103
4,201401010451,10.0,26.0,5.0,0.0,0,2014010104

In [58]:
weather["YR--MODAHRMN"] = pd.to_datetime(weather["YR--MODAHRMN"],format="%Y%m%d%H%M")
weather["YR--MODAHRMN"] = pd.to_datetime(weather["YR--MODAHRMN"]).dt.strftime('%Y-%m-%d-%H')
weather.drop([col for col in ["SPD","DEWP","IDX"] if col in weather], axis=1, inplace=True)
weather.columns=['Date', 'Temperature', 'Rain', 'Snow']

In [59]:
weather = weather.fillna(0)
weather.head()
np.sum(weather.isnull(), axis=0)

Date           0
Temperature    0
Rain           0
Snow           0
dtype: int64

In [ ]:
# Join tables

In [60]:
data = pd.concat([yellow, green], axis=0)

In [61]:
print yellow.shape
print green.shape
print data.shape

(10906858, 4)
(1445285, 4)
(12352143, 4)

In [62]:
dataall=pd.merge(data, weather, how='left', on=['Date'])

In [67]:
dataall.head()

,Date,Longitude,Latitude,Type,Temperature,Rain,Snow
0,2016-01-01-00,-73.990372,40.734695,yellow,45.0,0.0,0.0
1,2016-01-01-00,-73.980782,40.729912,yellow,45.0,0.0,0.0
2,2016-01-01-00,-73.984550,40.679565,yellow,45.0,0.0,0.0
3,2016-01-01-00,-73.993469,40.718990,yellow,45.0,0.0,0.0
4,2016-01-01-00,-73.960625,40.781330,yellow,45.0,0.0,0.0

In [64]:
dataall.shape

(12352143, 7)

In [65]:
# dataall.describe()

In [66]:
dataall.tail()

,Date,Longitude,Latitude,Type,Temperature,Rain,Snow
12352138,2016-01-31-23,-73.807716,40.700451,green,46.0,0.0,0.0
12352139,2016-01-31-23,-73.951408,40.714001,green,46.0,0.0,0.0
12352140,2016-01-31-23,-73.954842,40.730213,green,46.0,0.0,0.0
12352141,2016-01-31-23,-73.953491,40.817211,green,46.0,0.0,0.0
12352142,2016-01-31-23,-73.892578,40.747250,green,46.0,0.0,0.0

In [68]:
np.sum(dataall.isnull(), axis=0)

Date               0
Longitude          0
Latitude           0
Type               0
Temperature    22935
Rain           22935
Snow           22935
dtype: int64

In [69]:
dataall.to_csv('../output/jan_data.csv', sep='\t', encoding='utf-8', index_col=False)

In [14]:
# merge zipcode, run after the zipcodes are retrieved
import pandas as pd
zipcode = pd.read_csv('../output/zipcode_output.csv', sep='\t', index_col=False, dtype={'Zipcode':'S10'})

In [2]:
jan_zipcode = pd.read_csv('../output/jan_zipcode_output.csv', sep='\t', index_col=False)

In [13]:
zipcode.head()

,Coordinate,Zipcode
0,"40.75,-73.85",11368.0
1,"40.73,-73.77",11427.0
2,"40.75,-73.87",11372.0
3,"40.75,-73.86",11368.0
4,"40.75,-73.81",11355.0

In [4]:
# zipcode['Coordinate']

In [5]:
jan_zipcode.head()

,Unnamed: 0,Unnamed: 0.1,Date,Longitude,Latitude,Type,Temperature,Rain,Snow,Latitude1,Longitude1,Coordinate
0,0,0,2016-01-01-00,-73.990372,40.734695,yellow,45.0,0.0,0.0,40.73,-73.99,"40.73,-73.99"
1,1,1,2016-01-01-00,-73.980782,40.729912,yellow,45.0,0.0,0.0,40.72,-73.98,"40.72,-73.98"
2,2,2,2016-01-01-00,-73.984550,40.679565,yellow,45.0,0.0,0.0,40.67,-73.98,"40.67,-73.98"
3,3,3,2016-01-01-00,-73.993469,40.718990,yellow,45.0,0.0,0.0,40.71,-73.99,"40.71,-73.99"
4,4,4,2016-01-01-00,-73.960625,40.781330,yellow,45.0,0.0,0.0,40.78,-73.96,"40.78,-73.96"

In [6]:
print len(jan_zipcode)

12179050

In [7]:
jan = pd.merge(jan_zipcode, zipcode, how='left', on=['Coordinate'])

In [8]:
jan.head()

,Unnamed: 0,Unnamed: 0.1,Date,Longitude,Latitude,Type,Temperature,Rain,Snow,Latitude1,Longitude1,Coordinate,Zipcode
0,0,0,2016-01-01-00,-73.990372,40.734695,yellow,45.0,0.0,0.0,40.73,-73.99,"40.73,-73.99",10003
1,1,1,2016-01-01-00,-73.980782,40.729912,yellow,45.0,0.0,0.0,40.72,-73.98,"40.72,-73.98",10002
2,2,2,2016-01-01-00,-73.984550,40.679565,yellow,45.0,0.0,0.0,40.67,-73.98,"40.67,-73.98",11215
3,3,3,2016-01-01-00,-73.993469,40.718990,yellow,45.0,0.0,0.0,40.71,-73.99,"40.71,-73.99",10002
4,4,4,2016-01-01-00,-73.960625,40.781330,yellow,45.0,0.0,0.0,40.78,-73.96,"40.78,-73.96",10028

In [9]:
print len(jan)

12179070

In [10]:
jan.columns

Index([u'Unnamed: 0', u'Unnamed: 0.1', u'Date', u'Longitude', u'Latitude',
       u'Type', u'Temperature', u'Rain', u'Snow', u'Latitude1', u'Longitude1',
       u'Coordinate', u'Zipcode'],
      dtype='object')

In [15]:
jan.drop([col for col in ["Unnamed: 0","Unnamed: 0.1","Latitude1",\
                           "Longitude1","Coordinate","Snow"] \
                           if col in jan], axis=1, inplace=True)
jan.columns

Index([u'Date', u'Longitude', u'Latitude', u'Type', u'Temperature', u'Rain',
       u'Zipcode'],
      dtype='object')

In [16]:
jan_aggregate = jan.groupby(['Date', 'Temperature', 'Rain', 'Zipcode']).size().reset_index(name='Count')

In [17]:
jan_aggregate.tail()

,Date,Temperature,Rain,Zipcode,Count
95755,2016-01-31-23,46.0,0.0,11433,18
95756,2016-01-31-23,46.0,0.0,11434,1
95757,2016-01-31-23,46.0,0.0,11435,27
95758,2016-01-31-23,46.0,0.0,11436,1
95759,2016-01-31-23,46.0,0.0,11553,1

In [18]:
print len(jan_aggregate)

95760

In [19]:
jan_aggregate.to_csv('../output/jan_aggregate.csv', sep='\t', index_col=False, dtype={'Zipcode':'S10'})

In [22]:
# modify the date
import pandas as pd
model_data = pd.read_csv('../output/jan_aggregate.csv', sep='\t', encoding='utf-8', index_col=0, dtype={'Zipcode':'S10'})

In [23]:
model_data.head()

,Date,Temperature,Rain,Zipcode,Count
0,2016-01-01-00,45.0,0.0,07030,1
1,2016-01-01-00,45.0,0.0,07058,1
2,2016-01-01-00,45.0,0.0,07070,1
3,2016-01-01-00,45.0,0.0,07093,1
4,2016-01-01-00,45.0,0.0,07302,1

In [24]:
the_date = pd.to_datetime(model_data['Date'], format='%Y-%m-%d-%H')
model_data['Month'] = the_date.dt.month
model_data['Day']= the_date.dt.day
model_data['Hour']= the_date.dt.hour
temp = pd.DatetimeIndex(the_date)
model_data['Weekday'] = temp.weekday

In [25]:
model_data.tail()

,Date,Temperature,Rain,Zipcode,Count,Month,Day,Hour,Weekday
95755,2016-01-31-23,46.0,0.0,11433,18,1,31,23,6
95756,2016-01-31-23,46.0,0.0,11434,1,1,31,23,6
95757,2016-01-31-23,46.0,0.0,11435,27,1,31,23,6
95758,2016-01-31-23,46.0,0.0,11436,1,1,31,23,6
95759,2016-01-31-23,46.0,0.0,11553,1,1,31,23,6

In [26]:
model_data.columns

Index([       u'Date', u'Temperature',        u'Rain',     u'Zipcode',
             u'Count',       u'Month',         u'Day',        u'Hour',
           u'Weekday'],
      dtype='object')

In [27]:
model_data.columns = [c.replace(" ", "") for c in model_data.columns]
model_data.drop([col for col in ["Date", "Day"] \
                           if col in model_data], axis=1, inplace=True)

In [28]:
model_data.head()

,Temperature,Rain,Zipcode,Count,Month,Hour,Weekday
0,45.0,0.0,07030,1,1,0,4
1,45.0,0.0,07058,1,1,0,4
2,45.0,0.0,07070,1,1,0,4
3,45.0,0.0,07093,1,1,0,4
4,45.0,0.0,07302,1,1,0,4

In [29]:
final_data = model_data[['Temperature', 'Rain', 'Zipcode', 'Count', 'Month', 'Hour', 'Weekday']]
final_data.to_csv('../output/model_data.csv', sep='\t', encoding='utf-8', index_col=False)